Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Use persona and style fields to further fine-tune translations. These will be used in a prompt for OpenAI and allow you to change the style of the translations.
sv: AnvÃ¤nd fÃ¤lten persona och stil fÃ¶r att finjustera Ã¶versÃ¤ttningarna ytterligare. Dessa kommer att anvÃ¤ndas i en prompt fÃ¶r OpenAI och gÃ¶r det mÃ¶jligt fÃ¶r dig att Ã¤ndra stilen pÃ¥ Ã¶versÃ¤ttningarna.

source: Support for custom model and base URL was added.
sv: StÃ¶d fÃ¶r anpassad modell och bas-URL har lagts till.

source: `OpenAI models <https://platform.openai.com/docs/models>`_
sv: `OpenAI-modeller <https://platform.openai.com/docs/models>`_

source: `OpenAI API keys <https://platform.openai.com/api-keys>`_
sv: `OpenAI API-nycklar <https://platform.openai.com/api-keys>`_

source: Machine translation service provided by SAP.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av SAP.

source: You need to have a SAP account (and the SAP Translation Hub enabled in the SAP Cloud Platform) to use this service.
sv: Du mÃ¥ste ha ett SAP-konto (och SAP Translation Hub aktiverat i SAP Cloud Platform) fÃ¶r att kunna anvÃ¤nda denna tjÃ¤nst.

source: You can also configure whether to also use machine translation services, in addition to the term database.
sv: Du kan ocksÃ¥ konfigurera om du vill anvÃ¤nda maskinÃ¶versÃ¤ttningstjÃ¤nster utÃ¶ver termdatabasen.

source: To access the Sandbox API, you need to set ``url`` and ``key``.
sv: FÃ¶r att fÃ¥ Ã¥tkomst till Sandbox API mÃ¥ste du ange ``url`` och ``key``.

source: To access the productive API, you need to set ``url``, ``username`` and ``password``.
sv: FÃ¶r att fÃ¥ tillgÃ¥ng till det produktiva API:et mÃ¥ste du ange ``url``, ``username`` och ``password``.

source: Machine translation service provided by Systran.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av Systran.

source: This service uses an API, and you need to obtain API key at <https://translate.systran.net/en/account>.
sv: Denna tjÃ¤nst anvÃ¤nder ett API, och du mÃ¥ste skaffa en API-nyckel pÃ¥ <https://translate.systran.net/en/account>.

source: Weblate machine translation service can provide translations based on the exact matches of a string in the currently existing strings in a :guilabel:`Translated`, :guilabel:`Approved`, or :guilabel:`Read-only` :ref:`states <states>` inside Weblate.
sv: Weblates maskinÃ¶versÃ¤ttningstjÃ¤nst kan tillhandahÃ¥lla Ã¶versÃ¤ttningar baserade pÃ¥ exakta matchningar av en strÃ¤ng i de befintliga strÃ¤ngarna i :guilabel:`Translated`, :guilabel:`Approved` eller :guilabel:`Read-only` :ref:`states <states>` i Weblate.

source: Use :ref:`translation-memory` as a machine translation service. Any string that has been translated before (or uploaded to the translation memory) can be translated in this way. This suggestion source works with fuzzy matching.
sv: AnvÃ¤nd :ref:`translation-memory` som en maskinÃ¶versÃ¤ttningstjÃ¤nst. Alla strÃ¤ngar som har Ã¶versatts tidigare (eller laddats upp till Ã¶versÃ¤ttningsminnet) kan Ã¶versÃ¤ttas pÃ¥ detta sÃ¤tt. Denna fÃ¶rslagskÃ¤lla fungerar med fuzzy-matchning.

source: Recreating :ref:`translation-memory` reduces capabilities of this TM source.
sv: Ã terskapande av :ref:`translation-memory` minskar kapaciteten hos denna TM-kÃ¤lla.

source: Machine translation service provided by Yandex.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av Yandex.

source: This service uses a Translation API, and you need to obtain an API key from Yandex.
sv: Denna tjÃ¤nst anvÃ¤nder ett Ã¶versÃ¤ttnings-API, och du mÃ¥ste skaffa en API-nyckel frÃ¥n Yandex.

source: `Powered by Yandex.Translate <https://translate.yandex.com/>`_
sv: `Drivs av Yandex.Translate <https://translate.yandex.com/>`_

source: This service uses a Translation API, and you need to obtain an API key from Yandex Cloud.
sv: Denna tjÃ¤nst anvÃ¤nder ett Ã¶versÃ¤ttnings-API, och du mÃ¥ste skaffa en API-nyckel frÃ¥n Yandex Cloud.

source: `Powered by Yandex.Cloud <https://cloud.yandex.com/en/services/translate>`_
sv: `Drivs av Yandex.Cloud <https://cloud.yandex.com/en/services/translate>`_

source: Machine translation service provided by Youdao.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av Youdao.

source: This service uses an API, and you need to obtain an ID and an API key from Youdao.
sv: Denna tjÃ¤nst anvÃ¤nder ett API, och du mÃ¥ste skaffa ett ID och en API-nyckel frÃ¥n Youdao.

source: Custom machine translation
sv: Anpassad maskinÃ¶versÃ¤ttning

source: You can also implement your own machine translation services using a few lines of Python code. Place the code in a module Weblate can import (see :ref:`custom-module` or :ref:`docker-python-override`) and add fully qualified class name to :setting:`WEBLATE_MACHINERY`.
sv: Du kan ocksÃ¥ implementera dina egna maskinÃ¶versÃ¤ttningstjÃ¤nster med hjÃ¤lp av nÃ¥gra rader Python-kod. Placera koden i en modul som Weblate kan importera (se :ref:`custom-module` eller :ref:`docker-python-override`) och lÃ¤gg till det fullstÃ¤ndiga klassnamnet till :setting:`WEBLATE_MACHINERY`.

source: Management commands
sv: Ledningskommandon

source: Running management commands under a different user than the one running your webserver can result in files getting wrong permissions, please check :ref:`file-permissions` for more details.
sv: Om du kÃ¶r administrationskommandon under en annan anvÃ¤ndare Ã¤n den som kÃ¶r din webbserver kan det leda till att filer fÃ¥r fel behÃ¶righeter. Se :ref:`file-permissions` fÃ¶r mer information.

source: You will find basic management commands (available as :file:`./manage.py` in the Django sources, or as an extended set in a script called :command:`weblate` installable atop Weblate).
sv: Du hittar grundlÃ¤ggande hanteringskommandon (tillgÃ¤ngliga som :file:`./manage.py` i Django-kÃ¤llkoden, eller som en utÃ¶kad uppsÃ¤ttning i ett skript som heter :command:`weblate` som kan installeras ovanpÃ¥ Weblate).

source: Invoking management commands
sv: AnvÃ¤nda administrationskommandon

source: As mentioned before, invocation depends on how you installed Weblate.
sv: Som tidigare nÃ¤mnts beror anropet pÃ¥ hur du har installerat Weblate.

source: If using virtualenv for Weblate, you can either specify the full path to :command:`weblate`, or activate the virtualenv prior to invoking it:
sv: Om du anvÃ¤nder virtualenv fÃ¶r Weblate kan du antingen ange den fullstÃ¤ndiga sÃ¶kvÃ¤gen till :command:`weblate` eller aktivera virtualenv innan du startar det:

source: If you are using source code directly (either from a tarball or Git checkout), the management script is :file:`./manage.py` available in the Weblate sources. To run it:
sv: Om du anvÃ¤nder kÃ¤llkoden direkt (antingen frÃ¥n en tarball eller Git checkout) finns administrationsskriptet :file:`./manage.py` tillgÃ¤ngligt i Weblate-kÃ¤llorna. FÃ¶r att kÃ¶ra det:

source: If you've installed Weblate using the pip installer, or by using the :file:`./setup.py` script, the :command:`weblate` is installed to your path (or virtualenv path), from where you can use it to control Weblate:
sv: Om du har installerat Weblate med pip-installationsprogrammet eller med skriptet :file:`./setup.py`, installeras :command:`weblate` i din sÃ¶kvÃ¤g (eller virtualenv-sÃ¶kvÃ¤g), varifrÃ¥n du kan anvÃ¤nda det fÃ¶r att styra Weblate:

source: For the Docker image, the script is installed like above, and you can run it using :command:`docker exec`:
sv: FÃ¶r Docker-bilden installeras skriptet som ovan, och du kan kÃ¶ra det med :command:`docker exec`:

source: For :program:`docker-compose-plugin` the process is similar, you just have to use :command:`docker compose exec`:
sv: FÃ¶r :program:`docker-compose-plugin` Ã¤r processen liknande, du behÃ¶ver bara anvÃ¤nda :command:`docker compose exec`:

source: In case you need to pass it a file, you can temporary add a volume:
sv: Om du behÃ¶ver Ã¶verfÃ¶ra en fil kan du tillfÃ¤lligt lÃ¤gga till en volym:

source: Imports a translation from the file to use as a suggestion for the given translation. It skips duplicated translations; only different ones are added.
sv: Importerar en Ã¶versÃ¤ttning frÃ¥n filen fÃ¶r att anvÃ¤nda som fÃ¶rslag fÃ¶r den angivna Ã¶versÃ¤ttningen. Den hoppar Ã¶ver dubbla Ã¶versÃ¤ttningar; endast olika Ã¶versÃ¤ttningar lÃ¤ggs till.

source: E-mail of author for the suggestions. This user has to exist prior to importing (you can create one in the admin interface if needed).
sv: E-postadress till fÃ¶rfattaren fÃ¶r fÃ¶rslag. Denna anvÃ¤ndare mÃ¥ste finnas innan importen (du kan skapa en i administratÃ¶rsgrÃ¤nssnittet om det behÃ¶vs).

source: Added parameter for translation mode.
sv: Lagt till parameter fÃ¶r Ã¶versÃ¤ttningslÃ¤ge.

source: Performs automatic translation based on other component translations.
sv: UtfÃ¶r automatisk Ã¶versÃ¤ttning baserat pÃ¥ Ã¶versÃ¤ttningar frÃ¥n andra komponenter.

source: Specifies the component to use as source available for translation. If not specified all components in the project are used.
sv: Anger vilken komponent som ska anvÃ¤ndas som kÃ¤lla fÃ¶r Ã¶versÃ¤ttning. Om inget anges anvÃ¤nds alla komponenter i projektet.

source: Specify username listed as author of the translations. "Anonymous user" is used if not specified.
sv: Ange anvÃ¤ndarnamn som anges som fÃ¶rfattare till Ã¶versÃ¤ttningarna. Om inget anges anvÃ¤nds "Anonym anvÃ¤ndare".

source: Whether to overwrite existing translations.
sv: Om befintliga Ã¶versÃ¤ttningar ska skrivas Ã¶ver.

source: Whether to overwrite existing translations that are inconsistent (see :ref:`check-inconsistent`).
sv: Om befintliga Ã¶versÃ¤ttningar som Ã¤r inkonsekventa ska skrivas Ã¶ver (se :ref:`check-inconsistent`).

source: Automatically add language if a given translation does not exist.
sv: LÃ¤gg automatiskt till sprÃ¥k om en viss Ã¶versÃ¤ttning inte finns.

source: Use machine translation instead of other components as machine translations.
sv: AnvÃ¤nd maskinÃ¶versÃ¤ttning istÃ¤llet fÃ¶r andra komponenter som maskinÃ¶versÃ¤ttningar.

source: Similarity threshold for machine translation, defaults to 80.
sv: LikhetsgrÃ¤ns fÃ¶r maskinÃ¶versÃ¤ttning, standardvÃ¤rde Ã¤r 80.

source: Specify translation mode, default is ``translate`` but ``fuzzy`` or ``suggest`` can be used.
sv: Ange Ã¶versÃ¤ttningslÃ¤ge, standard Ã¤r ``translate`` men ``fuzzy`` eller ``suggest`` kan ocksÃ¥ anvÃ¤ndas.

source: Imports given content into Weblate, useful for benchmarking.
sv: Importerar innehÃ¥ll till Weblate, anvÃ¤ndbart fÃ¶r benchmarking.

source: Example of performance profiling
sv: Exempel pÃ¥ prestationsprofilering

source: Example of memory profiling
sv: Exempel pÃ¥ minnesprofilering

source: Creates a demo billing project. Can be executed multiple times to add additional invoices and billing events.
sv: Skapar ett demo-faktureringsprojekt. Kan kÃ¶ras flera gÃ¥nger fÃ¶r att lÃ¤gga till ytterligare fakturor och faktureringshÃ¤ndelser.

source: This can be useful when developing Weblate. Needs :ref:`billing` installed.
sv: Detta kan vara anvÃ¤ndbart vid utveckling av Weblate. KrÃ¤ver att :ref:`billing` Ã¤r installerat.

source: Displays length of Celery task queues.
sv: Visar lÃ¤ngden pÃ¥ Celery-uppgiftskÃ¶erna.

source: Prints current state of the back-end Git repository.
sv: Skriver ut det aktuella tillstÃ¥ndet fÃ¶r Git-arkivet pÃ¥ backend-sidan.

source: You can either define which project or component to update (for example ``weblate/application``), or use ``--all`` to update all existing components.
sv: Du kan antingen ange vilket projekt eller vilken komponent som ska uppdateras (till exempel ``weblate/application``) eller anvÃ¤nda ``--all`` fÃ¶r att uppdatera alla befintliga komponenter.

source: Commits any possible pending changes to the back-end Git repository.
sv: Sparar alla eventuella vÃ¤ntande Ã¤ndringar i Git-arkivet.

source: You can either define which project or component to update (for example ``weblate/application``), or use ``--all`` to update all existing components, or use ``--file-format`` to filter based on the file format.
sv: Du kan antingen ange vilket projekt eller vilken komponent som ska uppdateras (till exempel ``weblate/application``), anvÃ¤nda ``--all`` fÃ¶r att uppdatera alla befintliga komponenter eller anvÃ¤nda ``--file-format`` fÃ¶r att filtrera utifrÃ¥n filformatet.

source: Commits pending changes older than a given age.
sv: BekrÃ¤ftar vÃ¤ntande Ã¤ndringar som Ã¤r Ã¤ldre Ã¤n en viss Ã¥lder.

source: Age in hours for committing. If not specified the value configured in :ref:`component` is used.
sv: Ã lder i timmar fÃ¶r att begÃ¥. Om inget anges anvÃ¤nds det vÃ¤rde som konfigurerats i :ref:`component`.

source: This is automatically performed in the background by Weblate, so there no real need to invoke this manually, besides forcing an earlier commit than specified by :ref:`component`.
sv: Detta utfÃ¶rs automatiskt i bakgrunden av Weblate, sÃ¥ det finns inget egentligt behov av att gÃ¶ra detta manuellt, fÃ¶rutom fÃ¶r att tvinga fram en tidigare commit Ã¤n den som anges av :ref:`component`.

source: Cleans up orphaned checks and translation suggestions. There is normally no need to run this manually, as the cleanups happen automatically in the background.
sv: Rensar bort Ã¶vergivna kontroller och Ã¶versÃ¤ttningsfÃ¶rslag. Normalt behÃ¶ver detta inte kÃ¶ras manuellt, eftersom rensningen sker automatiskt i bakgrunden.

source: Removes all obsolete entries with pending status from the translation memory.
sv: Tar bort alla fÃ¶rÃ¥ldrade poster med status "vÃ¤ntande" frÃ¥n Ã¶versÃ¤ttningsminnet.

source: Performs cleanup of stored SSH host keys:
sv: Rensar lagrade SSH-vÃ¤rdnycklar:

source: Removes deprecated RSA keys for GitHub which might cause issues connecting to GitHub.
sv: Tar bort fÃ¶rÃ¥ldrade RSA-nycklar fÃ¶r GitHub som kan orsaka problem vid anslutning till GitHub.

source: Removes duplicate entries in host keys.
sv: Tar bort dubbla poster i vÃ¤rdnycklar.

source: Creates an ``admin`` account with a random password, unless it is specified.
sv: Skapar ett ``admin``-konto med ett slumpmÃ¤ssigt lÃ¶senord, om inget annat anges.

source: Provides a password on the command-line, to not generate a random one.
sv: Anger ett lÃ¶senord pÃ¥ kommandoraden fÃ¶r att inte generera ett slumpmÃ¤ssigt lÃ¶senord.

source: Do not set password, this can be useful with `--update`.
sv: Ange inte lÃ¶senord, detta kan vara anvÃ¤ndbart med `--update`.

source: Use the given name instead of ``admin``.
sv: AnvÃ¤nd det angivna namnet istÃ¤llet fÃ¶r ``admin``.

source: Specify the admin e-mail address.
sv: Ange administratÃ¶rens e-postadress.

source: Specify the admin name (visible).
sv: Ange administratÃ¶rens namn (synligt).

source: Update the existing user (you can use this to change passwords).
sv: Uppdatera befintlig anvÃ¤ndare (du kan anvÃ¤nda detta fÃ¶r att Ã¤ndra lÃ¶senord).

source: Export a JSON file containing Weblate Translation Memory content.
sv: Exportera en JSON-fil som innehÃ¥ller innehÃ¥llet i Weblate Translation Memory.

source: Dumps userdata to a file for later use by :wladmin:`importuserdata`.
sv: Sparar anvÃ¤ndardata till en fil fÃ¶r senare anvÃ¤ndning av :wladmin:`importuserdata`.

source: This comes in handy when migrating or merging Weblate instances.
sv: Detta Ã¤r praktiskt nÃ¤r man migrerar eller slÃ¥r samman Weblate-instanser.

source: Creates a demo project with components based on <https://github.com/WeblateOrg/demo>. Make sure the celery tasks are running before running this command.
sv: Skapar ett demoprojekt med komponenter baserade pÃ¥ <https://github.com/WeblateOrg/demo>. Se till att celery-uppgifterna kÃ¶rs innan du kÃ¶r detta kommando.

source: This can be useful when developing Weblate.
sv: Detta kan vara anvÃ¤ndbart vid utveckling av Weblate.

source: Removes existing demo project.
sv: Tar bort befintligt demoprojekt.

source: Batch import of components based on JSON data.
sv: Massimport av komponenter baserat pÃ¥ JSON-data.

source: The imported JSON file structure pretty much corresponds to the component object (see :http:get:`/api/components/(string:project)/(string:component)/`). You have to include the ``name`` and ``filemask`` fields.
sv: Den importerade JSON-filstrukturen motsvarar i stort sett komponentobjektet (se :http:get:`/api/components/(string:project)/(string:component)/`). Du mÃ¥ste inkludera fÃ¤lten ``name`` och ``filemask``.

source: Specifies where the components will be imported from.
sv: Anger varifrÃ¥n komponenterna ska importeras.

source: Use the given VCS repository from this component for all of them.
sv: AnvÃ¤nd det angivna VCS-arkivet frÃ¥n denna komponent fÃ¶r alla.

source: Skip (already) imported components.
sv: Hoppa Ã¶ver (redan) importerade komponenter.

source: Update (already) imported components.
sv: Uppdatera (redan) importerade komponenter.

source: Example of JSON file:
sv: Exempel pÃ¥ JSON-fil:

source: Imports a file into the Weblate translation memory.
sv: Importerar en fil till Weblate-Ã¶versÃ¤ttningsminnet.

source: Supported file formats are TMX, JSON, XLIFF, PO, CSV.
sv: FÃ¶ljande filformat stÃ¶ds: TMX, JSON, XLIFF, PO, CSV.

source: Specifying a source and a target languages might be necessary for formats other than JSON and TMX.
sv: Det kan vara nÃ¶dvÃ¤ndigt att ange kÃ¤llsprÃ¥k och mÃ¥lsprÃ¥k fÃ¶r andra format Ã¤n JSON och TMX.

source: Allows mapping languages in the TMX to the Weblate translation memory. The language codes are mapped after normalization usually done by Weblate.
sv: GÃ¶r det mÃ¶jligt att mappa sprÃ¥k i TMX till Weblate-Ã¶versÃ¤ttningsminnet. SprÃ¥kkoderna mappas efter normalisering, som vanligtvis utfÃ¶rs av Weblate.

source: ``--language-map en_US:en`` will for example import all ``en_US`` strings as ``en`` ones.
sv: ``--language-map en_US:en`` importerar till exempel alla ``en_US``-strÃ¤ngar som ``en``-strÃ¤ngar.

source: This can be useful in case your TMX file locales happen not to match what you use in Weblate.
sv: Detta kan vara anvÃ¤ndbart om dina TMX-filers sprÃ¥kinstÃ¤llningar inte stÃ¤mmer Ã¶verens med dem du anvÃ¤nder i Weblate.

source: Specifies the source language for imported translations. Typically needed for formats where the languages cannot be determined from the file itself.
sv: Anger kÃ¤llsprÃ¥ket fÃ¶r importerade Ã¶versÃ¤ttningar. BehÃ¶vs vanligtvis fÃ¶r format dÃ¤r sprÃ¥ken inte kan faststÃ¤llas utifrÃ¥n sjÃ¤lva filen.

source: Specifies the target language for imported translations. Typically needed for formats where the languages cannot be determined from the file itself.
sv: Anger mÃ¥lsprÃ¥ket fÃ¶r importerade Ã¶versÃ¤ttningar. BehÃ¶vs vanligtvis fÃ¶r format dÃ¤r sprÃ¥ken inte kan faststÃ¤llas utifrÃ¥n sjÃ¤lva filen.

source: Batch imports components into project based on the file mask. It is based on the :ref:`addon-weblate.discovery.discovery` add-on, so you might want to use that instead.
sv: Massimporterar komponenter till projektet baserat pÃ¥ filmasken. Det baseras pÃ¥ tillÃ¤gget :ref:`addon-weblate.discovery.discovery`, sÃ¥ du kanske vill anvÃ¤nda det istÃ¤llet.

source: `<project>` names an existing project, into which the components are to be imported.
sv: <project> namnger ett befintligt projekt, till vilket komponenterna ska importeras.

source: The `<gitrepo>` defines the Git repository URL to use, and `<branch>` signifies the Git branch. To import additional translation components from an existing Weblate component, use a `weblate://<project>/<component>` URL for the `<gitrepo>`.
sv: <gitrepo> definierar vilken Git-repository-URL som ska anvÃ¤ndas, och<branch> anger Git-grenen. FÃ¶r att importera ytterligare Ã¶versÃ¤ttningskomponenter frÃ¥n en befintlig Weblate-komponent anvÃ¤nder du en webate://<project>/<component> URL fÃ¶r<gitrepo>.

source: The `<filemask>` defines file discovery for the repository. It can be either be made simple using wildcards, or it can use the full power of regular expressions.
sv: <filemask> definierar filupptÃ¤ckt fÃ¶r arkivet. Det kan antingen gÃ¶ras enkelt med hjÃ¤lp av jokertecken eller sÃ¥ kan det utnyttja hela kraften i reguljÃ¤ra uttryck.

source: The simple matching uses ``**`` for component name and ``*`` for language, for example: ``**/*.po``
sv: Den enkla matchningen anvÃ¤nder ``**`` fÃ¶r komponentnamn och ``*`` fÃ¶r sprÃ¥k, till exempel: ``**/*.po``

source: The regular expression has to contain groups named `component` and `language`, for example: ``(?P<language>[^/]*)/(?P<component>[^-/]*)\.po``.
sv: Det reguljÃ¤ra uttrycket mÃ¥ste innehÃ¥lla grupper med namnen `component` och `language`, till exempel: ``(?P<language>[^/]*)/(?P<component>[^-/]*)\.po``.

source: The import matches existing components based on files and adds the ones that do not exist. It does not change already existing ones.
sv: Importen matchar befintliga komponenter baserat pÃ¥ filer och lÃ¤gger till de som inte finns. Den Ã¤ndrar inte redan befintliga komponenter.

source: Customize the name of a component using Django template syntax.
sv: Anpassa namnet pÃ¥ en komponent med hjÃ¤lp av Djangos mallsyntax.

source: For example: ``Documentation: {{ component }}``
sv: Till exempel: ``Dokumentation: {{ komponent }}``

source: Customize the base file for monolingual translations.
sv: Anpassa basfilen fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: For example: ``{{ component }}/res/values/string.xml``
sv: Till exempel: ``{{ component }}/res/values/string.xml``

source: Customize the base file for addition of new translations.
sv: Anpassa basfilen fÃ¶r att lÃ¤gga till nya Ã¶versÃ¤ttningar.

source: For example: ``{{ component }}/ts/en.ts``
sv: Till exempel: ``{{ component }}/ts/en.ts``

source: You can also specify the file format to use (see :ref:`formats`), the default is auto-detection.
sv: Du kan ocksÃ¥ ange vilket filformat som ska anvÃ¤ndas (se :ref:`formats`), standardinstÃ¤llningen Ã¤r automatisk detektering.

source: You can specify language filtering (see :ref:`component`) with this parameter. It has to be a valid regular expression.
sv: Du kan ange sprÃ¥kfiltrering (se :ref:`component`) med denna parameter. Det mÃ¥ste vara ett giltigt reguljÃ¤rt uttryck.

source: You can specify which component will be chosen as the main oneâthe one actually containing the VCS repository.
sv: Du kan ange vilken komponent som ska vÃ¤ljas som huvudkomponent â den som faktiskt innehÃ¥ller VCS-arkivet.

source: Specify the overall, project or component translation license.
sv: Ange den Ã¶vergripande Ã¶versÃ¤ttningslicensen, projektlicensen eller komponentlicensen.

source: Specify the URL where the translation license is to be found.
sv: Ange den URL dÃ¤r Ã¶versÃ¤ttningslicensen finns.

source: In case you need to specify which version control system to use, you can do it here. The default version control is Git.
sv: Om du behÃ¶ver ange vilket versionshanteringssystem som ska anvÃ¤ndas kan du gÃ¶ra det hÃ¤r. Standardversionshanteringen Ã¤r Git.

source: To give you some examples, let's try importing two projects.
sv: FÃ¶r att ge nÃ¥gra exempel, lÃ¥t oss prova att importera tvÃ¥ projekt.

source: First The Debian Handbook translations, where each language has separate a folder with the translations of each chapter:
sv: FÃ¶rst Ã¶versÃ¤ttningarna av Debian-handboken, dÃ¤r varje sprÃ¥k har en separat mapp med Ã¶versÃ¤ttningarna av varje kapitel:

source: Then the Tanaguru tool, where the file format needs be specified, along with the base file template, and how all components and translations are located in single folder:
sv: Sedan Tanaguru-verktyget, dÃ¤r filformatet mÃ¥ste anges, tillsammans med basfilmallen och hur alla komponenter och Ã¶versÃ¤ttningar finns i en enda mapp:
